Ran Plan for dir: `infrastructure` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # local_file.ansible_inventory will be created
+ resource "local_file" "ansible_inventory" {
      + content              = <<-EOT
            # This inventory describe a HA typology with stacked etcd (== same nodes as control plane)
            # and 3 worker nodes
            # See https://docs.ansible.com/ansible/latest/inventory_guide/intro_inventory.html
            # for tips on building your # inventory
            
            # Configure 'ip' variable to bind kubernetes services on a different ip than the default iface
            # We should set etcd_member_name for etcd cluster. The node that are not etcd members do not need to set the value,
            # or can set the empty string value.
            [kube_control_plane]
            master-1 ansible_host=158.160.118.67 ip=192.168.10.35 etcd_member_name=etcd1
            
            [etcd:children]
            kube_control_plane
            
            [kube_node]
            worker-1 ansible_host=46.21.245.242 ip=192.168.10.29
            worker-2 ansible_host=158.160.65.29 ip=192.168.20.3
            worker-3 ansible_host=158.160.195.106 ip=192.168.30.22
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./../ansible/kubespray/inventory/mycluster/inventory.ini"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d infrastructure
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-8696947c56-gwr44:4141/lock?id=Liberaty%252Fdiplom%252Finfrastructure%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d infrastructure
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```